import { FontAwesomeIcon } from '@fortawesome/react-fontawesome';
import React from 'react';
import webSquareImage from '../../../../src/assests/images/blogs/web/web-square.png';
import webRectangleImage from '../../../../src/assests/images/blogs/web/web-rectangle.png';
import programmingSquareImage from '../../../../src/assests/images/blogs/programming/programming-square.jpg';
import programmingRectangleImage from '../../../../src/assests/images/blogs/programming/programming-rectanglejpg.jpg';

const Blogs = () => {
    // const [blogs, setBlogs] = useState([]);
    // useEffect(() => {
    //     fetch("blogs.json")
    //         .then((res) => res.json())
    //         .then((data) => setBlogs(data));
    // }, []);

    const blogs = [
        {
            "_id": "1",
            "tag": "web-development",
            "pictureSquare": webSquareImage,
            "pictureRectangle": webRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "web-development",
            "pictureSquare": webSquareImage,
            "pictureRectangle": webRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "web-development",
            "pictureSquare": webSquareImage,
            "pictureRectangle": webRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "web-development",
            "pictureSquare": webSquareImage,
            "ppictureRectangle": webRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "web-development",
            "pictureSquare": webSquareImage,
            "pictureRectangle": webRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "web-development",
            "pictureSquare": webSquareImage,
            "pictureRectangle": webRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "programming",
            "pictureSquare": programmingSquareImage,
            "pictureRectangle": programmingRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
    ];

    const web = blogs.filter(blog => blog.tag === "web-development");
    console.log(web);

    return (
        <div id="blogs" className='bg-base-100 rounded-2xl mx-2 md:mx-8 lg:mx-28 px-4 md:px-8 lg:px-20 py-4 md:py-8 lg:py-16 my-4 md:my-8 lg:my-16 xl:my-20'>
            <div className='flex justify-start items-center mb-5 md:mb-8 lg:mb-10 xl:mb-12'>
                <h2 className="text-4xl font-Poppins font-bold mr-5"><span><FontAwesomeIcon className='mr-3 text-primary' icon="fa-solid fa-blog" /></span>Blogs</h2>
                <hr className="hidden md:block lg:block xl:block my-4 w-48 h-1 bg-gradient-to-r from-primary to-secondary rounded border-0" />
            </div>
            <hr className="block md:hidden lg:hidden xl:hidden my-4 w-full h-1 bg-gradient-to-r from-primary to-secondary rounded border-0 md:my-10" />
            {
                blogs.map(blog => <img src={blog.pictureRectangle} alt='' />)
            }
        </div>
    );
};

export default Blogs;