import { FontAwesomeIcon } from '@fortawesome/react-fontawesome';
import React from 'react';
import { Link, Outlet, Route, Router, Routes } from 'react-router-dom';
import webSquareImage from '../../../../src/assests/images/blogs/web/web-square.png';
import webRectangleImage from '../../../../src/assests/images/blogs/web/web-rectangle.png';
import programmingSquareImage from '../../../../src/assests/images/blogs/programming/programming-square.jpg';
import programmingRectangleImage from '../../../../src/assests/images/blogs/programming/programming-rectanglejpg.jpg';
import cSquareImage from '../../../../src/assests/images/blogs/c/c-square.jpg';
import cRectangleImage from '../../../../src/assests/images/blogs/c/c-rectangle.jpg';
import cssSquareImage from '../../../../src/assests/images/blogs/css/css-square.png';
import cssRectangleImage from '../../../../src/assests/images/blogs/css/css-rectangle.png';
import githubSquareImage from '../../../../src/assests/images/blogs/github/github-square.jpg';
import githubRectangleImage from '../../../../src/assests/images/blogs/github/github-rectangle.jpg';
import machineSquareImage from '../../../../src/assests/images/blogs/machine-learning/machine-square.jpg';
import machineRectangleImage from '../../../../src/assests/images/blogs/machine-learning/machine-rectangle.jpg';
import AllBlog from './AllBlogs/AllBlogs';
import WebBlogs from './WebBlogs/WebBlogs';
import ProgrammingBlogs from './ProgrammingBlogs/ProgrammingBlogs';
import GithubBlogs from './GithubBlogs/GithubBlogs';
import BlogBanner from './BlogBanner/BlogBanner';

const Blogs = () => {
    const blogs = [
        {
            "_id": "1",
            "tag": "web-development",
            "pictureSquare": webSquareImage,
            "pictureRectangle": webRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "web-development",
            "pictureSquare": webSquareImage,
            "pictureRectangle": webRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "web-development",
            "pictureSquare": webSquareImage,
            "pictureRectangle": webRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "web-development",
            "pictureSquare": webSquareImage,
            "ppictureRectangle": webRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "web-development",
            "pictureSquare": webSquareImage,
            "pictureRectangle": webRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "web-development",
            "pictureSquare": webSquareImage,
            "pictureRectangle": webRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "programming",
            "pictureSquare": programmingSquareImage,
            "pictureRectangle": programmingRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "programming",
            "pictureSquare": programmingSquareImage,
            "pictureRectangle": programmingRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "programming",
            "pictureSquare": programmingSquareImage,
            "pictureRectangle": programmingRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "programming",
            "pictureSquare": programmingSquareImage,
            "pictureRectangle": programmingRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "programming",
            "pictureSquare": programmingSquareImage,
            "pictureRectangle": programmingRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "programming",
            "pictureSquare": programmingSquareImage,
            "pictureRectangle": programmingRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "c",
            "pictureSquare": cSquareImage,
            "pictureRectangle": cRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "c",
            "pictureSquare": cSquareImage,
            "pictureRectangle": cRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "c",
            "pictureSquare": cSquareImage,
            "pictureRectangle": cRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "c",
            "pictureSquare": cSquareImage,
            "pictureRectangle": cRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "c",
            "pictureSquare": cSquareImage,
            "pictureRectangle": cRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "css",
            "pictureSquare": cssSquareImage,
            "pictureRectangle": cssRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "css",
            "pictureSquare": cssSquareImage,
            "pictureRectangle": cssRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "css",
            "pictureSquare": cssSquareImage,
            "pictureRectangle": cssRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "css",
            "pictureSquare": cssSquareImage,
            "pictureRectangle": cssRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "css",
            "pictureSquare": cssSquareImage,
            "pictureRectangle": cssRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "css",
            "pictureSquare": cssSquareImage,
            "pictureRectangle": cssRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "github",
            "pictureSquare": githubSquareImage,
            "pictureRectangle": githubRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "github",
            "pictureSquare": githubSquareImage,
            "pictureRectangle": githubRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "github",
            "pictureSquare": githubSquareImage,
            "pictureRectangle": githubRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "github",
            "pictureSquare": githubSquareImage,
            "pictureRectangle": githubRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "github",
            "pictureSquare": githubSquareImage,
            "pictureRectangle": githubRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "github",
            "pictureSquare": githubSquareImage,
            "pictureRectangle": githubRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "machine-learning",
            "pictureSquare": machineSquareImage,
            "pictureRectangle": machineRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "machine-learning",
            "pictureSquare": machineSquareImage,
            "pictureRectangle": machineRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "machine-learning",
            "pictureSquare": machineSquareImage,
            "pictureRectangle": machineRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "machine-learning",
            "pictureSquare": machineSquareImage,
            "pictureRectangle": machineRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
        {
            "_id": "1",
            "tag": "machine-learning",
            "pictureSquare": machineSquareImage,
            "pictureRectangle": machineRectangleImage,
            "title": "ওয়েব ডেভেলপমেন্ট পরিচিতি-যা কিছু জানা প্রয়োজন",
            "details": "আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে। আমাদের প্রথমে জানতে হবে যে ওয়েব ডেভেলপমেন্ট কি? স্বাভাবিক ভাসায় বলতে গেলে ইন্টারনেট (প্রাইভেট নেটওয়ার্ক) এর জন্য যে সকল ওয়েবসাইট, সফটওয়্যার ও অ্যাপ্লিকেশন তৈরি করা হয় এগুলো প্রবর্তন করার কৌশল অবলম্বন করাকে বলে ওয়েব ডেভেলপমেন্ট। আমরা অনেকে আছি যারা এখনো জানিনা যে ওয়েব ডেভেলপমেন্ট আর ওয়েব ডিজাইনিং কি।আসলে এইটা কিন্ত এক না অনেক পার্থক্য রয়েছে।",
            "bloggerName": "Abir Hasan",
            "blogDate": "jan-19-2023"
        },
    ];

    const webs = blogs.filter(blog => blog.tag === "web-development");
    const programmings = blogs.filter(blog => blog.tag === "programming");
    const cs = blogs.filter(blog => blog.tag === "c");
    const csss = blogs.filter(blog => blog.tag === "css");
    const githubs = blogs.filter(blog => blog.tag === "github");
    const machines = blogs.filter(blog => blog.tag === "machine-learning");


    return (
        <div id="blogs" className='bg-base-100 rounded-2xl mx-2 md:mx-8 lg:mx-28 px-4 md:px-8 lg:px-20 py-4 md:py-8 lg:py-16 my-4 md:my-8 lg:my-16 xl:my-20'>
            <div className='flex justify-start items-center mb-5 md:mb-8 lg:mb-10 xl:mb-12'>
                <h2 className="text-4xl font-Poppins font-bold mr-5"><span><FontAwesomeIcon className='mr-3 text-primary' icon="fa-solid fa-blog" /></span>Blogs</h2>
                <hr className="hidden md:block lg:block xl:block my-4 w-48 h-1 bg-gradient-to-r from-primary to-secondary rounded border-0" />
            </div>
            <hr className="block md:hidden lg:hidden xl:hidden my-4 w-full h-1 bg-gradient-to-r from-primary to-secondary rounded border-0 md:my-10" />

            {/* blog banner */}
            <BlogBanner></BlogBanner>
            {/* blog banner */}

            {/* blog menu */}
            <div className="">
                <Link to='/blogs' className='bg-accent rounded-full hover:bg-gradient-to-r from-primary to-secondary font-Poppins hover:text-white px-2 py-1 text-xs inline-flex justify-center items-center font-bold'>
                    <p className='px-1'>All</p>
                    <div className='bg-white rounded-full text-neutral p-[2px] w-5 h-5'><p>{webs.length}</p></div>
                </Link>
                <Link to='web-blogs' className='bg-accent rounded-full hover:bg-gradient-to-r from-primary to-secondary font-Poppins hover:text-white px-2 py-1 text-xs inline-flex justify-center items-center font-bold'>
                    <p className='px-1'>web development</p>
                    <div className='bg-white rounded-full text-neutral p-[2px] w-5 h-5'><p>{webs.length}</p></div>
                </Link>
                <Link to='programming-blogs' className='bg-accent rounded-full hover:bg-gradient-to-r from-primary to-secondary font-Poppins hover:text-white px-2 py-1 text-xs inline-flex justify-center items-center font-bold'>
                    <p className='px-1'>programming</p>
                    <div className='bg-white rounded-full text-neutral p-[2px] w-5 h-5'><p>{webs.length}</p></div>
                </Link>
                <Link to='github-blogs' className='bg-accent rounded-full hover:bg-gradient-to-r from-primary to-secondary font-Poppins hover:text-white px-2 py-1 text-xs inline-flex justify-center items-center font-bold'>
                    <p className='px-1'>github</p>
                    <div className='bg-white rounded-full text-neutral p-[2px] w-5 h-5'><p>{webs.length}</p></div>
                </Link>
            </div>
            {/* blog menu */}

            <h2>Blog showing hereeeee</h2>

            {/* nested routes render here */}
            <Outlet></Outlet>
            {/* nested routes render here */}

        </div>
    );
};

export default Blogs;